#+title:     Org-mode
#+author:    Logan Barnett
#+email:     logustus@gmail.com
#+date:      <2020-06-06 Sat>
#+language:  en
#+file_tags:
#+tags:

** text
I need json and other text code blocks to be treated as content.

Lifted from
https://emacs.stackexchange.com/questions/24247/org-mode-pipe-source-block-output-as-stdin-to-next-source-block

Specifically https://emacs.stackexchange.com/a/51734/14851

Do I actually need this though?

#+name: config/org-babel-passthrough
#+begin_src emacs-lisp :results none :tangle yes
(defun config/org-mode-org-babel-execute:passthrough (body params)
  body)
(defalias 'org-babel-execute:json 'config/org-mode-org-babel-execute:passthrough)
(defalias 'org-babel-execute:text 'config/org-mode-org-babel-execute:passthrough)
(defalias 'org-babel-execute:yaml 'config/org-mode-org-babel-execute:passthrough)
(defalias 'org-babel-execute:conf 'config/org-mode-org-babel-execute:passthrough)
;; The post says to use this, but I found everything works without it.
;; (add-to-list 'org-babel-load-languages '(passthrough . t))
#+end_src

Here's the test:
#+NAME: json-test
#+BEGIN_SRC json
  {"greet": "hello, world"}
#+END_SRC

#+HEADER: :stdin json-test
#+BEGIN_SRC sh
  jq .greet
#+END_SRC

#+RESULTS:
: hello, world

#+name: greet/text
#+begin_src text
hi
#+end_src

#+begin_src shell :noweb yes
echo <<greet/text>>
#+end_src

#+RESULTS:
: hi



It works!
** languages

There is a snippet for source blocks in [[file:../yasnippets/org-mode/srcb]] which
allows an auto complete of languages (major modes).  Getting that list of what
languages are available requires some work though.  The best list we can get is
from =auto-mode-alist=.  We should evaluate this every time since it can
potentially change as we edit our configuration.  This function we will define
will be used in the snippet.

#+name: config/org-babel-source-block-languages-fn
#+begin_src emacs-lisp :results none :tangle yes
(defun auto-mode-alist-pair-to-org-babel-language (auto-mode-pair)
  (replace-regexp-in-string
   "-mode$"
   ""
   ;; Perhaps obscure.  Can be found in describe-variable which is where we
   ;; found out the modes that auto-mode-alist uses in the first place.
   (cl-prin1-to-string
    (let ((auto-mode (cdr auto-mode-pair)))
      (if (listp auto-mode)
        ;; This is some kind of weird nested list when this happens.
        (cdr (cdr auto-mode))
        auto-mode
        )
     )
     )
   )
  )

(defun config/org-babel-languages-available ()
  (require 'dash)
  (-uniq
   (-sort
    #'string-lessp
    (-map #'auto-mode-alist-pair-to-org-babel-language auto-mode-alist)
    )
   )
  )
#+end_src

Test it!

#+begin_src emacs-lisp :results value list :noweb yes
<<config/org-babel-source-block-languages-fn>>

(config/org-babel-languages-available)
#+end_src

#+RESULTS:
- antlr
- applescript
- archive
- asm
- authinfo
- autoconf
- awk
- bat
- bibtex
- bibtex-style
- bovine-grammar
- c
- c++
- c-or-c++
- change-log
- compilation
- conf
- conf-colon
- conf-desktop
- conf-javaprop
- conf-mode-maybe
- conf-ppd
- conf-space
- conf-toml
- conf-unix
- conf-windows
- conf-xdefaults
- csharp
- css
- dcl
- delphi
- diff
- dns
- doc-view-mode-maybe
- dockerfile
- doctex
- dsssl
- ebrowse-tree
- editorconfig-conf
- elisp-byte-code
- elm
- emacs-lisp
- enh-ruby
- erts
- f90
- feature
- fortran
- fundamental
- gdb-script
- gfm
- git-rebase
- gitattributes
- gitconfig
- gitignore
- glsl
- go
- go-dot-mod
- go-dot-work
- graphviz-dot
- groovy
- hcl
- hexl
- icon
- idl
- idlwave
- image
- java
- javascript
- js
- js-json
- json
- latex
- ld-script
- less-css
- lisp
- lisp-data
- lua
- m2
- m4
- mail
- makefile-automake
- makefile-bsdmake
- makefile-gmake
- makefile-imake
- makefile-makepp
- markdown
- metafont
- metapost
- mhtml
- mixal
- nil
- nix
- nix-drv
- nroff
- objc
- octave-maybe
- org
- pascal
- perl
- pike
- plantuml
- prolog
- ps
- puppet
- python
- rjsx
- rst
- ruby
- rustic
- scad
- scheme
- scribe
- scss
- ses
- sgml
- sh
- shell-script
- sieve
- simula
- skk-jisyo-edit
- snmp
- snmpv2
- sql
- srecode-template
- tar
- tcl
- terraform
- tex
- texinfo
- text
- typescript
- typescript-tsx
- vera
- verilog
- vhdl
- vimrc
- wisent-grammar
- xml
- yaml
** prompting for timestamps programmatically
=org-time-stamp= is very handy in that it has a rich user interface for
selecting/guessing a date and time to use. However this date and time is
inserted directly into the buffer. This creates difficulties with composition,
such as using in the context of snippets. Using the simple recommendation in
this [[https://emacs.stackexchange.com/a/69012][Stack Overflow post]], we can just create a temporary buffer, have it insert
there, and grab the result.

#+name: config/org-time-stamp-string
#+begin_src emacs-lisp :results none :tangle yes
(defun org-time-stamp-string (time inactive)
  (with-temp-buffer
    (insert (or time ""))
    (org-mode)
    (org-time-stamp nil inactive)
    (buffer-substring (point-min) (point-max))
    )
  )
#+end_src

It's also helpful to have a timestamp without the actual brackets (used for
inactive and active timestamps). This allows us to pipe the results easily to
date parsing mechanisms.

Here's the regular expression we need:

#+name: config/inactive-timestamp-sans-bracket-regexp
#+begin_src emacs-lisp :reesults none :tangle yes
(defvar inactive-timestamp-sans-bracket-regexp
  "\\[\\([^]]+\\)\\]"
  )
#+end_src

#+name: config/org-time-stamp-string-sans-brackets
#+begin_src emacs-lisp :results none :tangle yes :noweb yes

<<config/inactive-timestamp-sans-bracket-regexp>>

(defun org-time-stamp-string-sans-brackets (&optional default)
  (interactive)
  (let* (
         (time (org-time-stamp-string default t))
         (match (string-match inactive-timestamp-sans-bracket-regexp time))
         )
    (match-string 1 time)
    )
  )
#+end_src

Here's a test. Don't forget you can use =(re-builder)= to interactively test.

#+begin_src emacs-lisp :tangle no
(let* (
      (timestamp  "[2023-07-14 Fri]")
       (match (string-match inactive-timestamp-sans-bracket-regexp timestamp))
    )
  (string= (match-string 1 timestamp) "2023-07-14 Fri")
  )
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp :tangle no
(org-time-stamp-string-sans-brackets)
#+end_src

#+RESULTS:
: 2023-08-18 Fri

And test with an arbitrary date.

#+begin_src emacs-lisp :tangle no
(org-time-stamp-string-sans-brackets "[2023-08-17 Thu]")
#+end_src

#+RESULTS:
: 2023-08-18 Fri

** clock a full day

It's really handy to clock a full day of work retroactively without having to
munge all of the timestamps. I do this a lot for vacation/sick days.

I've tried using this with =yasnippet=, but I run into problems with the
prompting mechanism interfering with the snippet mechanism in the first place.
It doesn't really need to be a snippet. We can just insert the text from an
interactive function.

Later, we can even make it smart enough to look at the heading and default to
that time.

#+name: config/clock-full-day
#+begin_src emacs-lisp :results none :tangle yes :noweb yes

<<config/inactive-timestamp-sans-bracket-regexp>>

(defun clock-full-day ()
  (interactive)
  (let*
      (
       (parent-heading (-last-item (org-get-outline-path t)))
       (default-time (if (string-match inactive-timestamp-sans-bracket-regexp
                                  parent-heading
                                  )
                    parent-heading
                  (format-time-string "[%Y-%M-%d %a]")
                  )
         )
       )
    (insert
     (format
      ":LOGBOOK:
CLOCK: %s
:END:
"
      (let (
            (timestamp (org-time-stamp-string-sans-brackets default-time))
            )
        (format "[%s 09:00]--[%s 17:00] => 8:00" timestamp timestamp)
        )
      )
     )
    )
  )
#+end_src

Test that =org-get-outline-path= does what we expect.

#+begin_src emacs-lisp :tangle no
(message "%s" (-last-item (org-get-outline-path t)))
#+end_src

#+RESULTS:
: clock a full day
** inactive timestamp with both date and time

#+name: config/org-mode-insert-inactive-time-stamp-with-time-fn
#+begin_src emacs-lisp :results none :tangle no
(defun config/org-mode-insert-inactive-time-stamp-with-time ()
  (interactive)
  (org-insert-time-stamp (current-time) t t)
  )
#+end_src

Show the code works.

#+begin_src emacs-lisp :results value :tangle no :noweb yes
<<config/org-mode-insert-inactive-time-stamp-with-time-fn>>
(with-temp-buffer
  (config/org-mode-insert-inactive-time-stamp-with-time)
  )
#+end_src

#+RESULTS:
: [2023-10-03 Tue 19:38]

